//=============================================================================
//
// フェード処理 [fade.h]
// Author : 
//
//=============================================================================
#ifndef ___FADE_H___
#define ___FADE_H___

#include "main.h"

//*************************************
// フェードの状態
//*************************************
enum FADE
{
	FADE_NONE = 0,		// 何もない状態
	FADE_W_OUT,			// フェードアウト処理(白)
	FADE_B_OUT,			// フェードアウト処理(黒)
	FADE_IN,			// フェードイン処理
	FADE_MAX
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitFade(void);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);

void SetFade(FADE fade, E_STAGE next );
FADE GetFade(void);

#endif
