//=============================================================================
//
// 左手処理 [hand.h]
// Author : GP11A243 06 楳田健斗
//
//=============================================================================
#ifndef _HAND_H_
#define _HAND_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_HAND_SIZE_X		(48)		// テクスチャサイズ
#define TEXTURE_HAND_SIZE_Y		(48)		// 同上

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
typedef struct	// 手構造体
{
	bool			use;						// true:使用  false:未使用
	D3DXVECTOR3		pos;						// 移動量
	D3DXVECTOR3		rot;						// 回転量
	float			dirRot;						// 回転量(方向)
	float			subRot;

	LPDIRECT3DTEXTURE9	Texture;				// テクスチャ情報
	VERTEX_2D		vertexWk[NUM_VERTEX];		// 頂点情報格納ワーク

	float			Radius;						// 半径
	float			BaseAngle;					// 角度

} HAND;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitHand(int type);
void UninitHand(void);
void UpdateHand(void);
void DrawHand(void);

HAND *GetHand();

#endif
