//=============================================================================
//
// ミニマップ処理 [minimap.h]
// Author : GP11A243 06 楳田健斗
//
//=============================================================================
#ifndef _MINIMAP_H_
#define _MINIMAP_H_

#include "main.h"

// マクロ定義
#define MINIMAP_SIZE_SMALL	(4.0f)	// ミニマップのサイズ
#define MINIMAP_SIZE_LARGE	(16.0f)	// ミニマップのサイズ
//*****************************************************************************
// 構造体宣言
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitMiniMap(void);
void UninitMiniMap(void);
void UpdateMiniMap(void);
void DrawMiniMap(void);

void SetMiniMap(int startX, int startY, int endX, int endY);

#endif
