//=============================================================================
//
// ミニマップ処理 [minimap.h]
// Author : GP11A243 06 楳田健斗
//
//=============================================================================
#ifndef _MINIMAP_H_
#define _MINIMAP_H_

#include "main.h"

// マクロ定義
#define TEXTURE_MINIMAP_SIZE_X	(4.0f)	// テクスチャサイズ
#define TEXTURE_MINIMAP_SIZE_Y	(4.0f)	// 同上
//*****************************************************************************
// 構造体宣言
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitMiniMap(void);
void UninitMiniMap(void);
void UpdateMiniMap(void);
void DrawMiniMap(void);


#endif
