//=============================================================================
//
// 敵処理 [pointer.h]
// Author : GP11A243 06 楳田健斗
//
//=============================================================================
#ifndef _POINTER_H_
#define _POINTER_H_

#include "main.h"
#include "dungeon.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// 構造体宣言
//*****************************************************************************
// ポインター構造体
typedef struct	
{
	bool			use;						// true:使用  false:未使用
	int				no;							// ナンバー
	D3DXVECTOR3		pos;						// 移動量
	D3DXVECTOR3		rot;						// 回転量
	float			subRot;						// 縦揺れ

	LPDIRECT3DTEXTURE9	Texture;				// テクスチャ情報
	VERTEX_2D		vertexWk[NUM_VERTEX];		// 頂点情報格納ワーク

	float			Radius;						// 半径
	float			BaseAngle;					// 角度
} POINTER;



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPointer(int type);
void UninitPointer(void);
void UpdatePointer(void);
void DrawPointer(void);
void SetPointer(int no);

#endif
